import { Paragraph, Picture } from "../../../components/atoms"
import { warmFront } from "../../../constants/images"


export const WarmFront = () => {
    return (
        <>
            <Picture source={warmFront} />
            <Paragraph>
                Тёплый фронт - атмосферный фронт, перемещающийся в сторону более холодного воздуха (наблюдается адвекция тепла). За тёплым фронтом в данный регион приходит тёплая воздушная масса.
            </Paragraph>
            <Paragraph>
                На карте погоды тёплый фронт отмечается красным цветом или зачернёнными полукружками, направленными в сторону перемещения фронта. По мере приближения линии тёплого фронта начинает падать давление, уплотняются облака, выпадают обложные осадки. Зимой при прохождении фронта обычно появляются низкие слоистые облака. Температура и влажность воздуха медленно повышаются. При прохождении фронта температура и влажность обычно быстро возрастают, ветер усиливается. После прохождения фронта направление ветра меняется (ветер поворачивает по часовой стрелке), падение давления прекращается и начинается его слабый рост, облака рассеиваются, осадки прекращаются. Поле барических тенденций представлено следующим образом: перед тёплым фронтом располагается замкнутая область падения давления, за фронтом - либо рост давления, либо относительный рост (падение, но меньшее, чем перед фронтом).
            </Paragraph>
            <Paragraph>
                В случае тёплого фронта тёплый воздух, перемещаясь в сторону холодного, натекает на клин холодного воздуха и совершает восходящее скольжение вдоль этого клина и динамически охлаждается. На некоторой высоте, определяемой начальным состоянием восходящего воздуха, достигается насыщение - это уровень конденсации. Выше этого уровня в восходящем воздухе происходит облакообразование. Адиабатическое охлаждение тёплого воздуха, скользящего вдоль клина холодного, усиливается развитием восходящих движений от нестационарности при динамическом падении давления и от сходимости ветра в нижнем слое атмосферы. Охлаждение тёплого воздуха при восходящем скольжении по поверхности фронта приводит к образованию характерной системы слоистообразных облаков (облаков восходящего скольжения): перисто-слоистые - высоко-слоистые -слоисто-дождевые (Cs-As-Ns).
            </Paragraph>
            <Paragraph>
                При приближении к пункту тёплого фронта с хорошо развитой облачностью сначала появляются перистые облака в виде параллельных полос с когтевидными образованиями в передней части (предвестники тёплого фронта), вытянутые в направлении воздушных течений на их уровне (Ci uncinus). Первые перистые облака наблюдаются на расстоянии многих сотен километров от линии фронта у поверхности Земли (около 800-900 км). Перистые облака переходят затем в перисто-слоистые облака (Cirrostratus). Для этих облаков характерны явления гало. Облака верхнего яруса - перисто-слоистые и перистые (Ci и Cs) состоят из ледяных кристаллов, и осадки из них не выпадают. Чаще всего облака Ci-Cs представляют собой самостоятельный слой, верхняя граница которого совпадает с осью струйного течения, то есть близка к тропопаузе.
            </Paragraph>
            <Paragraph>
                Затем облака становятся всё плотнее: высоко-слоистые облака (Altostratus) постепенно переходят в слоисто-дождевые (Nimbostratus), начинают выпадать обложные осадки, которые ослабевают или совсем прекращаются после прохождения линии фронта. По мере приближения к линии фронта высота основания Ns снижается. Минимальное её значение определяется высотой уровня конденсации в восходящем тёплом воздухе. Высокослоистые (As) являются коллоидальными и состоят из смеси мельчайших капелек и снежинок. Их вертикальная мощность довольно значительна: начинаясь на высоте 3-5 км, эти облака простираются до высот порядка 4-6 км, то есть имеют 1-3 км в толщину. Выпадающие из этих облаков осадки летом, проходя сквозь тёплую часть атмосферы, испаряются и не всегда достигают поверхности Земли. Зимой осадки из As в виде снега почти всегда достигают поверхности Земли, а также стимулируют выпадение осадков из нижележащих St-Sc. В этом случае ширина зоны обложных осадков может достигать ширины 400 км и более. Ближе всего к поверхности Земли (на высоте нескольких сотен метров, а порой 100-150 м и даже ниже) находится нижняя граница слоисто-дождевых облаков (Ns), из которых выпадают обложные осадки в виде дождя или снега; под слоисто-дождевыми облаками нередко развиваются разорванно-дождевые (St fr).
            </Paragraph>
            <Paragraph>
                Облака Ns простираются до высот 3…7 км, то есть имеют весьма значительную вертикальную мощность. Облака также состоят из ледяных элементов и капель, причём, и капли и кристаллы особенно в нижней части облаков более крупные, чем в As. Нижнее основание системы облаков As-Ns в общих чертах совпадает с поверхностью фронта. Поскольку верхняя граница облаков As-Ns приблизительно горизонтальна, наибольшая их толщина наблюдается вблизи линии фронта. У центра циклона, где система облаков тёплого фронта имеет наибольшее развитие, ширина облачной зоны Ns и зоны обложных осадков в среднем - около 300 км. В целом облака As-Ns имеют ширину 500-600 км, ширина зоны облаков Ci-Cs - около 200-300 км. Если спроецировать данную систему на приземную карту, то вся она окажется перед линией тёплого фронта на расстоянии 700-900 км. В отдельных случаях зона облачности и осадков может быть значительно шире или уже, в зависимости от угла наклона фронтальной поверхности, высоты уровня конденсации, термических условий нижней тропосферы.
            </Paragraph>
            <Paragraph>
                В ночное время радиационное выхолаживание верхней границы облачной системы As-Ns и понижение температуры в облаках, а также усиление вертикального перемешивания при опускании охлаждённого воздуха внутрь облака способствует образованию ледяной фазы в облаках, росту облачных элементов и образованию осадков. По мере удаления от центра циклона восходящие движения воздуха ослабевают, осадки прекращаются. Фронтальные облака могут образовываться не только над наклонной поверхностью фронта, а в некоторых случаях - и по обе стороны от фронта. Это особенно характерно для начальной стадии циклона, когда восходящие движения захватывают зафронтальную область - тогда и осадки могут выпадать с обеих сторон фронта. Но за линией фронта фронтальная облачность обычно сильно расслоена и зафронтальные осадки чаще представлены в виде мороси или снежных зёрен.
            </Paragraph>
            <Paragraph>
                В случае очень пологого фронта система облаков может быть смещена вперед от линии фронта. В тёплое время года восходящие движения вблизи линии фронта приобретают характер конвективных, и на тёплых фронтах нередко развиваются кучево-дождевые облака и наблюдаются ливневые осадки и грозы (как днём, так и ночью).
            </Paragraph>
            <Paragraph>
                Летом в дневные часы в приземном слое за линией тёплого фронта при значительной облачности температура воздуха над сушей может быть ниже, чем перед фронтом. Это явление называется маскировкой тёплого фронта.
            </Paragraph>
            <Paragraph>
                Облачность старых тёплых фронтов также может быть расслоенной на всём протяжении фронта. Постепенно эти слои рассеиваются и осадки прекращаются. Порой тёплый фронт не сопровождается осадками (особенно летом). Так бывает при малом влагосодержании тёплого воздуха, когда уровень конденсации лежит на значительной высоте. При сухости воздуха и особенно в случае его заметной устойчивой стратификации восходящее скольжение тёплого воздуха не приводит к развитию мало-мальски мощной облачности - то есть облака вообще отсутствуют, либо наблюдается полоса облаков верхнего и среднего ярусов.
            </Paragraph>
        </>
    )
}