import { Paragraph, Picture } from "../../../components/atoms"
import { cirrusFibratus } from "../../../constants/images"

export const CirrusFibratus = () => {
    return (
        <>
            <Picture source={cirrusFibratus} />
            <Paragraph>
                Перистые волокнистые - Cirrus fibratus (Ci fib) и высоко кучевые облака - Altocumulus (+Ac). Облака Ci fib - длинное белые иногда почти прямолинейные нити, которые могут располагаться то почти параллельно, то причудливо перепутанным клубком. Являются наиболее общей формой облаков верхнего яруса. Обычно состоят из кристаллов льда, которые возникают из переохлажденных капелек воды. Отличаются большей протяженностью и тем, что не заполняют все небо, а главное, обладают характерной прерывистой структурой. Чаще всего перистые облака наблюдаются при хорошей погоде и наличии восходящего потока воздуха при наступлении теплого фронта. Высота основания в умеренных широтах составляет 7-10 км, в тропиках они достигают 17-18 км. В арктических широтах облака при низких температурах могут распространяться до поверхности земли. Толщина слоя облаков может колебаться в широких пределах, от сотен метров до нескольких километров.
            </Paragraph>
            <Paragraph>
                Перистые облака обычно прозрачны, сквозь них просвечивает солнце, луна и яркие звезды, а иногда и голубое небо. Днем они не уменьшают освещенности, а наземные предметы отбрасывают заметные тени. Осадки- мелкие ледяные кристаллы, из которых состоят перистые облака, могут медленно падать, но почти всегда испаряются на больших высотах, не достигая земли и образуют только полосы падения. В редких случаях при очень низких температурах ледяные кристаллы возникают и в нижнем слое атмосферы, но при выпадении измеренного количества осадков не дают ( на станциях отмечаются только следы осадков).
            </Paragraph>
            <Paragraph>
                Образование перистых облаков происходит за счет охлаждения воздуха при восходящем движении в средней тропосфере в зоне атмосферных фронтов. В охлаждающемся воздухе происходит сублимация водяного пара и образование ледяных кристаллов. Мелкие ледяные кристаллы падают весьма медленно и восходящими движениями воздуха могут переноситься на более высокие уровни.
            </Paragraph>
            <Paragraph>
                Вечером, после захода солнца, Ci еще долго остаются освещенными, принимая серебристую, затем золотистую или красноватую окраску. Затем Ci постепенно сереют, при этом кажутся более плотными. Утром, перед восходом солнца, они первыми окрашиваются зарей.
            </Paragraph>
        </>
    )
}