import { Paragraph } from "../../../components/atoms"

export const Fog = () => {
    return (
        <>
            <Paragraph>
                <Paragraph bold>Туман</Paragraph> - взвешенные в воздухе у поверхности земли капли воды или кисталлы льда, ухудшающие видимость до 1 км и менее.
            </Paragraph>
            <Paragraph><Paragraph bold>Дымка</Paragraph> - взвешенные в воздухе у поверхности земли капли воды или кисталлы льда, ухудшающие видимость от 2 до 9 км.</Paragraph>
            <Paragraph>
                Туман образуется в результате конденсации водяного пара в непосредственной близости от земной поверхности. По своей физической природе туман подобен облаку. Часто одно явление переходит в другое. Например, когда туман приподнимается, то он преобразуется в низкие разорванно-слоистые облака. И, наоборот, облака, снижаясь до поверхности земли, воспринимаются как явление тумана.
            </Paragraph>
            <Paragraph>
                Образование тумана связано главным образом с охлаждением приземного слоя воздуха, поэтому в зависимости от того, как происходит процесс охлаждения воздуха, туманы делятся на три типа: радиационные, адвективные, фронтальные.
            </Paragraph>
            <Paragraph>
                <Paragraph bold>Радиационный туман</Paragraph> образуется вследствие выхолаживания поверхности земли и прилегающего к ней слоя воздуха, при этом возникает инверсия температуры и при достаточной влажности воздуха образуется приземный туман, называемый радиационным. Наибольшая повторяемость радиационных туманов приходится на ночные часы, когда нет притока солнечной радиации, а земная поверхность и воздух теряют тепло в результате излучения. Радиационный туман отличается наибольшей плотностью у поверхности земли и видимость здесь часто ухудшается до нескольких десятков метров. С высотой плотность убывает, и с высоты полета земля сквозь него видна хорошо. С восходом солнца (началом прогрева) радиационный туман, как правило, рассеивается.
            </Paragraph>
            <Paragraph>
                <Paragraph bold>Адвективный туман</Paragraph> образуется при охлаждении относительно теплого и влажного воздуха, движущегося над более холодной подстилающей поверхностью. Зимой адвективный туман образуется, как правило, в воздушной массе, перемещающейся с океана на материк; летом — с материка на океан. Адвективный туман, в отличие от радиационного, возникает при более значительных скоростях ветра у поверхности земли, которые чаще всего бывают 4—8 м/сек, но он может образовываться и при более сильном ветре, достигающем 12— 15 м/сек. Особенностью адвективного тумана является также увеличение плотности с высотой. При этом видимость у поверхности земли может быть вполне удовлетворительной, но стоит подняться на несколько десятков метров (30—50 м), как горизонтальная видимость совершенно исчезает.
            </Paragraph>
            <Paragraph>
                Адвективный туман может образовываться в любую часть суток и сохраняться в течение длительного времени.
            </Paragraph>
            <Paragraph>
                <Paragraph bold>Фронтальные туманы</Paragraph>  — туманы, возникающие на атмосферных фронтах. Они бывают трех типов: пред- фронтальные, фронтальные и зафронтальные.
            </Paragraph>
            <Paragraph>
                Наиболее благоприятные условия для образования предфронтального тумана, когда температура выпадающего дождя значительно выше температуры холодного воздуха, располагающегося вблизи поверхности земли.
            </Paragraph>
            <Paragraph>
                Фронтальный туман возникает непосредственно при прохождении фронта. Такой туман представляет собой фронтальную облачную систему, распространяющуюся до поверхности земли, особенно часто наблюдается при прохождении фронтов над возвышенностями.
            </Paragraph>
            <Paragraph>
                Зафронтальный туман образуется непосредственно после прохождения теплого фронта или теплой окклюзии. Образование зафронтального тумана мало чем отличается от условий образования адвективного тумана.
            </Paragraph>
            <Paragraph bold>Кроме указанных выше, основных, наиболее часто встречающихся, видов туманов, наблюдаются и другие, как-то:
            </Paragraph>
            <Paragraph>
                адвективно-радиационные;
            </Paragraph>
            <Paragraph>
                туманы склонов;
            </Paragraph>
            <Paragraph>
                туманы испарений;
            </Paragraph>
            <Paragraph>
                морозные или ледяные туманы.
            </Paragraph>
        </>
    )
}

export const Blizzard = () => {
    return (
        <>
            <Paragraph><Paragraph bold>Метель</Paragraph> — перенос снега над поверхностью земли ветром достаточной силы. Различают три вида метели: поземок, низовая метель и общая метель.</Paragraph>
            <Paragraph><Paragraph bold>Позёмок</Paragraph> — перенос сухого снега ветром непосредственно над поверхностью снежного покрова. Поземок возникает при скорости ветра 4—6 м/сек, при этом снег поднимается до высоты в несколько десятков сантиметров.</Paragraph>
            <Paragraph><Paragraph bold>Низовая метель</Paragraph> — явление, схожее с поземком, стой лишь разницей, что она бывает при более сильном ветре. При низовой метели снег поднимается до высоты в несколько метров.</Paragraph>
            <Paragraph>Как поземок, так и низовая метель ухудшают видимость в самых нижних слоях атмосферы.</Paragraph>
            <Paragraph><Paragraph bold>Общая метель</Paragraph> характеризуется сильным ветром, поднимающим снег с земной поверхности, и выпадением снега из облаков.</Paragraph>
        </>
    )
}

export const DustStorm = () => {
    return (
        <>
            <Paragraph><Paragraph bold>Пыльная или песчаная буря</Paragraph> — явление аналогичное низовой метели, но с той лишь разницей, что пыльная буря бывает в южных степях и пустынях преимущественно летом, когда сильным ветром с поверхности земли поднимаются частицы песка или пыли, которые, замутняя атмосферу, резко ухудшают видимость.</Paragraph>
            <Paragraph>Вертикальная мощность пыльных бурь может быть самой различной— от нескольких десятков сантиметров (пыльные и песчаные поземки) до нескольких десятков и даже сотен метров.</Paragraph>
        </>
    )
}